mrv96/ESP8266_SensorNode/src/main.cpp
      jsonDoc["ip"] = WiFi.localIP().toString();
      jsonDoc["gateway"] = WiFi.gatewayIP().toString();
      jsonDoc["subnet"] = WiFi.subnetMask().toString();
      jsonDoc["dns1"] = WiFi.dnsIP(0).toString();
      jsonDoc["dns2"] = WiFi.dnsIP(1).toString();
      jsonDoc["ssid"] = WiFi.SSID();
      jsonDoc["pwd"] = WiFi.psk();
  
      File configFile = SPIFFS.open("/config.json", "w");
      if (!configFile) {
        Serial.println("failed to open config file for writing");
      }

      serializeJsonPretty(jsonDoc, Serial);
      serializeJson(jsonDoc, configFile);
      configFile.close();
      //end save
      shouldSaveConfig = false;
    }
}

//==============================================================
//                  SETUP
//==============================================================
void setup(void){
  Serial.begin(115200);

  struct ConfigSetting conf;

  if(setupSpiffs(&conf) == false) {
    routineWM();
  } else {
    WiFi.disconnect();

    WiFi.mode(WIFI_STA);

    WiFi.config(conf.ip, conf.gateway, conf.netmask, conf.dns1, conf.dns2);
    WiFi.begin(conf.ssid,conf.pwd);

    uint32_t cnt = 0;
    while (WiFi.status() != WL_CONNECTED/* && cnt < TIMEOUT_MS*/)
    {
      cnt += TIMEOUT_STEP_MS;
      delay(TIMEOUT_STEP_MS);
      Serial.print(".");
    }

    if(WiFi.status() != WL_CONNECTED) {
      routineWM();
    }
  }
  
  //If connection successful show IP address in serial monitor
  Serial.println("");
  Serial.print("Connected to ");
  Serial.println("WiFi");
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());  //IP address assigned to your ESP

  MDNS.begin(MDNS_NAME);
 
  server.on("/", handleRoot);      //Which routine to handle at root location
  server.on("/action_page", handleForm); //form action is handled here

  server.begin();                  //Start server
  Serial.println("HTTP server started");

  MDNS.addService("http", "tcp", 80);
  Serial.println("MDNS started");
}
//==============================================================
//                     LOOP
//==============================================================
void loop(void){
  server.handleClient();          //Handle client requests
  MDNS.update();
}

#elif defined(MARIO)

//RF_DEFAULT = 0, // RF_CAL or not after deep-sleep wake up, depends on init data byte 108.
//RF_CAL = 1,      // RF_CAL after deep-sleep wake up, there will be large current.
//RF_NO_CAL = 2,   // no RF_CAL after deep-sleep wake up, there will only be small current.
//RF_DISABLED = 4 // disable RF after deep-sleep wake up, just like modem sleep, there will be the smallest current.
//#define WAKE_RF_DEFAULT  RF_DEFAULT
//#define WAKE_RFCAL       RF_CAL
//#define WAKE_NO_RFCAL    RF_NO_CAL
//#define WAKE_RF_DISABLED RF_DISABLED

#include <ESP8266WiFi.h>
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include <ThingSpeak.h>

//from BSEC library:
#define BSEC_MAX_STATE_BLOB_SIZE     (139)        /*!< Maximum size (in bytes) of the data blobs returned by bsec_get_state()*/

#define FW_VERSION "V0.2"

#define BUTTON_PIN D3

#define FACTORY_RESET_TIME_MS 5000

#define DEEPSLEEP_CORRECTION_TIME_US (14000000ULL) //to be found experimentally. Maybe it varies for each different ESP8266 chip

#define ACDC_TH_VOLTAGE 4.5
#define OFF_TH_VOLTAGE 3

#define SAMPLE_PERIOD_US (5*60*1000000ULL)
static_assert(SAMPLE_PERIOD_US%300000000ULL == 0, "SAMPLE_PERIOD_US must be multiple of 5min!");
//#define CONF_UPDATE_TIME_US (10*60*1000000ULL)
//static_assert(SAMPLE_PERIOD_US >= CONF_UPDATE_TIME_US, "Conf. time cannot be greater than the time between two samples!");

//#define HTU21D_SENSOR //default
#define BME680_SENSOR

#if defined(HTU21D_SENSOR) && defined(BME680_SENSOR)
  #undef BME680_SENSOR
#endif

//NumCH & WriteAPI
//Mario46 + Cucina46: 998086, QZL25Q0X3LWQLYKH
//Sabina46 + Appartamento48: 998096, TZD96RGWP4QNZM41
//Nonno18: 1007621, 7DOVMP5V15NZPH9P

//Default: 1, Cucina46: 4, Appartamento48: 4
#define FIRST_FIELD 4

//----------------  Fill in your credentials   ---------------------
#define WLAN_SSID "Infostrada-852489"             // your network SSID (name) 
#define WLAN_PASSWD "Dizzymoon262!"               // your network password
//Thingiverse credentials
unsigned long myChannelNumber = 998086;           // Replace the 0 with your channel number
const char *myWriteAPIKey = "QZL25Q0X3LWQLYKH";   // Paste your ThingSpeak Write API Key between the quotes 
//------------------------------------------------------------------

int set_fields(uint8_t firstField, uint8_t nFields, float *arr) {
  int x = 0;
  
  for(int i=0; i<nFields; i++) x |= ThingSpeak.setField(firstField+i, arr[i]);

  return x;
}

uint32_t calculateCRC32(const uint8_t *data, size_t length) {
  uint32_t crc = 0xffffffff;
  while (length--) {
    uint8_t c = *data++;
    for (uint32_t i = 0x80; i > 0; i >>= 1) {
      bool bit = crc & 0x80000000;
      if (c & i) {
        bit = !bit;
      }
      crc <<= 1;
      if (bit) {
        crc ^= 0x04c11db7;
      }
    }
  }
  return crc;
}

uint32_t fwVersionToUINT32(char* str) {
  return str[0]<<24 | str[1]<<16 | str[2]<<8 | str[3];
}

struct rtc{
  uint64_t sensor_state_time = 0; //due to program code it must be before crc32 field!
  uint32_t crc32 = 0;
  uint8_t ch;
  uint8_t ap_mac[6];
  //uint8_t sensor_state[4*((BSEC_MAX_STATE_BLOB_SIZE-1)/4+1)] = {0}; //used only for CRC32 in HTU21D
  uint8_t sensor_state[BSEC_MAX_STATE_BLOB_SIZE] = {0}; //used only for CRC32 in HTU21D
  uint64_t cntSleepTime_us = SAMPLE_PERIOD_US;
  uint32_t fwVersion = 0;
  //uint32_t enableConf = 1;
  //uint8_t padding; //find it increasing until the vector until the compiler error disappear
} rtcData;

static_assert(sizeof(rtcData)%4 == 0, "sizeof(rtcData) must be multiple of 4 bytes!");
static_assert(sizeof(rtcData)<=512, "RTC structure too big! RTC memory size is 512 bytes.");

uint16_t crcDataLength = sizeof(rtcData)-(((uint8_t*) &rtcData.crc32)+sizeof(rtcData.crc32)-((uint8_t*) &rtcData));

#ifdef BME680_SENSOR
//#include <Arduino.h>
#include <sys/time.h>
#include <bsec.h>
/* Configure the BSEC library with information about the sensor
    18v/33v = Voltage at Vdd. 1.8V or 3.3V
    3s/300s = BSEC operating mode, BSEC_SAMPLE_RATE_LP or BSEC_SAMPLE_RATE_ULP
    4d/28d = Operating age of the sensor in days
    generic_18v_3s_4d
    generic_18v_3s_28d
    generic_18v_300s_4d
    generic_18v_300s_28d
    generic_33v_3s_4d
    generic_33v_3s_28d
    generic_33v_300s_4d
    generic_33v_300s_28d
*/
const uint8_t bsec_config_iaq[] = {
#include "config/generic_33v_300s_4d/bsec_iaq.txt"
};

#define CS_PIN D8

#define LOG(fmt, ...) (Serial.printf("%lu: " fmt "\n", millis(), ##__VA_ARGS__))

#define N_FIELDS 5

Bsec sensor;

bsec_virtual_sensor_t sensor_list[] = {
  BSEC_OUTPUT_RAW_TEMPERATURE,
  BSEC_OUTPUT_RAW_PRESSURE,
  BSEC_OUTPUT_RAW_HUMIDITY,
  BSEC_OUTPUT_RAW_GAS,
  BSEC_OUTPUT_IAQ,
  BSEC_OUTPUT_STATIC_IAQ,
  BSEC_OUTPUT_CO2_EQUIVALENT,
  BSEC_OUTPUT_BREATH_VOC_EQUIVALENT,
  BSEC_OUTPUT_SENSOR_HEAT_COMPENSATED_TEMPERATURE,
  BSEC_OUTPUT_SENSOR_HEAT_COMPENSATED_HUMIDITY,
};

bool CheckSensor() {
  if (sensor.status < BSEC_OK) {
    LOG("BSEC error, status %d!", sensor.status);
    return false;
  } else if (sensor.status > BSEC_OK) {
    LOG("BSEC warning, status %d!", sensor.status);
  }

  if (sensor.bme680Status < BME680_OK) {
    LOG("Sensor error, bme680_status %d!", sensor.bme680Status);
    return false;
  } else if (sensor.bme680Status > BME680_OK) {
    LOG("Sensor warning, status %d!", sensor.bme680Status);
  }

