mrv96/ESP8266_SensorNode/src/main.cpp
  return true;
}

#else

#include <Wire.h>
#include <HTU21D.h>

#define SDA_PIN D2
#define SCL_PIN D1

/*
HTU21D(resolution)
resolution:
HTU21D_RES_RH12_TEMP14 - RH: 12Bit, Temperature: 14Bit, by default
HTU21D_RES_RH8_TEMP12  - RH: 8Bit,  Temperature: 12Bit
HTU21D_RES_RH10_TEMP13 - RH: 10Bit, Temperature: 13Bit
HTU21D_RES_RH11_TEMP11 - RH: 11Bit, Temperature: 11Bit
*/
HTU21D myHTU21D(HTU21D_RES_RH12_TEMP14);

#endif

void connectWiFi(struct rtc *rtcData, bool rtcValid) {
  //Switch Radio back On
  WiFi.forceSleepWake();
  delay(1);

  // Disable the WiFi persistence.  The ESP8266 will not load and save WiFi settings unnecessarily in the flash memory.
  WiFi.persistent(false);

  // Bring up the WiFi connection
  WiFi.mode( WIFI_STA );
  //WiFi.config( ip,dns, gateway, subnet ); //STATIC CONFIG
  //-----------Now we replace the normally used "WiFi.begin();" with a precedure using connection data stored by us
  if(rtcValid) {
    // The RTC data was good, make a quick connection
    WiFi.begin(WLAN_SSID, WLAN_PASSWD, rtcData->ch, rtcData->ap_mac, true);
  } else {
    // The RTC data was not valid, so make a regular connection
    WiFi.begin(WLAN_SSID, WLAN_PASSWD);
  }

  //------now wait for connection
  int retries = 0;
  int wifiStatus = WiFi.status();
  while( wifiStatus != WL_CONNECTED ) { //look also WiFi.waitForConnectResult()
    retries++;
    if( retries == 100 ) {
      // Quick connect is not working, reset WiFi and try regular connection
      rtcValid = false;
      WiFi.disconnect();
      delay(10);
      WiFi.forceSleepBegin();
      delay(10);
      WiFi.forceSleepWake();
      delay(10);
      WiFi.begin(WLAN_SSID, WLAN_PASSWD);
    }
    if(retries == 600) {
      // Giving up after n seconds and going back to sleep
      WiFi.disconnect( true );
      delay(1);
      WiFi.mode( WIFI_OFF );
      ESP.deepSleep(5e6);
      return; // Not expecting this to be called, the previous call will never return.
    }
    delay(50);
    wifiStatus = WiFi.status();
  }

  if(!rtcValid) {
    // Write current connection info back to RTC
    rtcData->ch = WiFi.channel();
    memcpy( rtcData->ap_mac, WiFi.BSSID(), 6 ); // Copy 6 bytes of BSSID (AP's MAC address)
    rtcData->crc32 = calculateCRC32(((uint8_t*) &rtcData->crc32)+sizeof(rtcData->crc32), crcDataLength);
    ESP.rtcUserMemoryWrite(0, (uint32_t*) rtcData, sizeof(struct rtc));
  }
}

// Save boot up time by not configuring them if they haven't changed
//if(WiFi.SSID() != ssid) {
//  Serial.println(F("Initialising Wifi..."));
//  WiFi.mode(WIFI_STA);
//  WiFi.begin(ssid, pass);
//  WiFi.persistent(true);
//  WiFi.setAutoConnect(true);
//  WiFi.setAutoReconnect(true);
//}
//while(WiFi.waitForConnectResult() != WL_CONNECTED) {
//  Serial.println("Connection Failed! Rebooting...");
//  ESP.deepSleep(5e6); //restart after 5 sec
//}

void handleInterrupt() {
  uint64_t tmpTime, initTime = millis();
  
  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, HIGH);

  while((tmpTime=millis())-initTime<FACTORY_RESET_TIME_MS && (digitalRead(BUTTON_PIN)==LOW))
    yield();

  if(tmpTime-initTime >= FACTORY_RESET_TIME_MS) {
    //TODO: factoryReset();
  }
  else {
    digitalWrite(LED_BUILTIN, LOW);
  }
}

void setup() {
  // we disable WiFi, coming from DeepSleep, as we do not need it right away
  WiFi.mode( WIFI_OFF );
  WiFi.forceSleepBegin();
  delay(1);
  
  Serial.begin(115200);
  Serial.println("\nBooting");

  //float battery = ((R1+R2)/R2)*(analogRead(A0)/1023);
  float battery = (585.0/115.0)*(analogRead(A0)/1023.0);

  if(battery >= ACDC_TH_VOLTAGE) {
    pinMode(BUTTON_PIN, INPUT); //Pullup not needed because external resistor
    attachInterrupt(digitalPinToInterrupt(BUTTON_PIN), handleInterrupt, FALLING);
  }

  // Read struct from RTC memory
  uint32_t crcOfData;
  bool rtcValid = false;

  if (ESP.rtcUserMemoryRead(0, (uint32_t*) &rtcData, sizeof(rtcData))) {
    crcOfData = calculateCRC32(((uint8_t*) &rtcData.crc32)+sizeof(rtcData.crc32), crcDataLength);
    Serial.print("CRC32 of data: ");
    Serial.println(crcOfData, HEX);
    Serial.print("CRC32 read from RTC: ");
    Serial.println(rtcData.crc32, HEX);
    if (crcOfData != rtcData.crc32) {
      Serial.println("CRC32 in RTC memory doesn't match CRC32 of data. Data is probably invalid!");
    } else {
      Serial.println("CRC32 check ok, data is probably valid.");
      rtcValid = true;
    }
  }//else ERRORE!!!

  uint32_t currentFw = fwVersionToUINT32((char*) FW_VERSION);
  if(rtcData.fwVersion != currentFw) {
    rtcValid = false;
    rtcData.fwVersion = currentFw;
  }

  //If crc32 not valid reset the struct to default values
  if(!rtcValid) {
    rtcData.sensor_state_time = 0;
    rtcData.cntSleepTime_us = SAMPLE_PERIOD_US;
//    rtcData.enableConf = 1;
  }

//  bool enableConf = rtcData.enableConf;
//  if(battery < ACDC_TH_VOLTAGE && !enableConf)
//    rtcData.enableConf = 1;
//  else if(battery >= ACDC_TH_VOLTAGE && enableConf)
//    rtcData.enableConf = 0;

  uint64_t intermediateTime = 0;

#ifdef BME680_SENSOR
  
  SPI.begin();
  sensor.begin(CS_PIN, SPI);
  if (!CheckSensor()) {
    //LOG("Failed to init BME680, check wiring!");
    ESP.deepSleep(5e6);
    return;
  }

  //LOG("BSEC version %d.%d.%d.%d", sensor.version.major, sensor.version.minor, sensor.version.major_bugfix, sensor.version.minor_bugfix);

  sensor.setConfig(bsec_config_iaq);
  if (!CheckSensor()) {
    //LOG("Failed to set config!");
    ESP.deepSleep(5e6);
    return;
  }

  if(rtcValid) {
    sensor.setState(rtcData.sensor_state);
    if (!CheckSensor()) {
      //LOG("Failed to set state!");
      ESP.deepSleep(5e6);
      return;
    } else {
      LOG("Successfully set state, CRC32: %u", rtcData.crc32);
    }
  } else {
    LOG("Saved state missing");
    memset(rtcData.sensor_state,0,sizeof(rtcData.sensor_state)); //actually needed?
  }

  sensor.updateSubscription(sensor_list, sizeof(sensor_list) / sizeof(sensor_list[0]), BSEC_SAMPLE_RATE_ULP);
  if (!CheckSensor()) {
    //LOG("Failed to update subscription!");
    ESP.deepSleep(5e6);
    return;
  }

  float data[N_FIELDS];
  
  intermediateTime = micros();

  /******** GET DATA *******/
  if(sensor.run((rtcData.sensor_state_time += intermediateTime)/1000)) {
    LOG("Temperature raw %.2f compensated %.2f", sensor.rawTemperature, sensor.temperature);
    LOG("Humidity raw %.2f compensated %.2f", sensor.rawHumidity, sensor.humidity);
    LOG("Pressure %.2f kPa", sensor.pressure / 1000);
    LOG("IAQ %.0f accuracy %d", sensor.iaq, sensor.iaqAccuracy);
    LOG("Static IAQ %.0f accuracy %d", sensor.staticIaq, sensor.staticIaqAccuracy);
    LOG("Gas resistance %.2f kOhm", sensor.gasResistance / 1000);

    // Write to ThingSpeak. There are up to 8 fields in a channel, allowing you to store up to 8 different
    // pieces of information in a channel.
//    int setField(field, value);
//    int setStatus(status);
//    int setLatitude(latitude);
//    int setLongitude(longitude);
//    int setElevation(elevation);
//    int setCreatedAt(createdAt);

    data[0] = sensor.temperature;
    data[1] = sensor.humidity;
    data[2] = sensor.pressure / 100;
    data[3] = ((int)(sensor.iaq+0.5))+((sensor.iaqAccuracy+1)%4)/10.0; //in questo modo se accuracy = 3 ho solo valori interi, i decimali indicano iaqAccuracy+1 (N.B. se accuracy = 3 IAQ avrebbe dei decimali che arrotondo all'intero più vicino)
    data[4] = battery;
    
    sensor.getState(rtcData.sensor_state);
    CheckSensor(); //Only useful to notify error/warnings through serial
  } else {
    LOG("Failed to get data!");
    ESP.deepSleep(5e6);
    return;
  }

