mrv96/ESP8266_SensorNode/src/main.cpp
  uint64_t sleepTime_us = sensor.nextCall*1000 - rtcData.sensor_state_time + intermediateTime; //updated only inside run() method
  LOG("%llu: %llu", rtcData.sensor_state_time, sensor.nextCall);

  if(rtcData.cntSleepTime_us >= SAMPLE_PERIOD_US) rtcData.cntSleepTime_us = sleepTime_us;
  else rtcData.cntSleepTime_us += sleepTime_us;

  rtcData.crc32 = calculateCRC32(((uint8_t*) &rtcData.crc32)+sizeof(rtcData.crc32), crcDataLength);
  ESP.rtcUserMemoryWrite(0, (uint32_t*) &rtcData, sizeof(rtcData));
  //Serial.println(F("Saved state to RTC memory at %lld", rtcData.crc32));

#else

  if(!rtcValid) {
    rtcData.crc32 = calculateCRC32(((uint8_t*) &rtcData.crc32)+sizeof(rtcData.crc32), crcDataLength);
    ESP.rtcUserMemoryWrite(0, (uint32_t*) &rtcData, sizeof(rtcData));
  }

  if(myHTU21D.begin(SDA_PIN, SCL_PIN) != true) {
    //Serial.println(F("HTU21D, SHT21 sensor is faild or not connected"));
    ESP.deepSleep(5e6);
    return;
  }
  //Serial.println(F("HTU21D, SHT21 sensor is active"));

  float data[] = {myHTU21D.readTemperature(), myHTU21D.readCompensatedHumidity(), battery};

  if(data[0] == HTU21D_ERROR || data[1] == HTU21D_ERROR) {
    //Serial.println(F("I2C communication error happened."));
    ESP.deepSleep(5e6);
    return;
  }

  uint64_t sleepTime_us = SAMPLE_PERIOD_US;

#endif

  if(battery >= ACDC_TH_VOLTAGE) {
    connectWiFi(&rtcData, rtcValid);
  }

  if(rtcData.cntSleepTime_us-sleepTime_us == 0) {
    if(battery < ACDC_TH_VOLTAGE) {
      connectWiFi(&rtcData, rtcValid);
    }

    WiFiClient  client;
    ThingSpeak.begin(client);
    int x;

    if((x=set_fields(FIRST_FIELD, sizeof(data)/sizeof(data[0]), data)) == 200) {
      if((x=ThingSpeak.writeFields(myChannelNumber, myWriteAPIKey)) != 200) {
        Serial.println("QUI2");
        Serial.println("Problem updating channel. HTTP error code " + String(x));
        ESP.deepSleep(5e6);
        return;
      }
    } else Serial.println("ThingSpeak error code " + String(x));
  }

  //Check for remote updates
//  t_httpUpdate_return ret = ESPhttpUpdate.update("192.168.0.2", 80, "/esp/update/arduino.php", "optional current version string here");
//  switch(ret) {
//      case HTTP_UPDATE_FAILED:
//          //Serial.println("[update] Update failed.");
//          break;
//      case HTTP_UPDATE_NO_UPDATES:
//          //Serial.println("[update] Update no Update.");
//          break;
//      case HTTP_UPDATE_OK:
//          //Serial.println("[update] Update ok."); // may not be called since we reboot the ESP
//          break;
//  }

//PROBLEMA: autoriscaldamento della scheda
//SOLUZIONE2: web server per update. No config o possibile gestione di account per configurazione
//SOLUZIONE3: stare attivo solo tot tempo per config e update, poi tornare a fare normalmente
  

  if(battery >= ACDC_TH_VOLTAGE) {
    // Port defaults to 8266
    // ArduinoOTA.setPort(8266);
  
    // Hostname defaults to esp8266-[ChipID]
    // ArduinoOTA.setHostname("myesp8266");
  
    // No authentication by default
    // ArduinoOTA.setPassword("admin");
  
    // Password can be set with it's md5 value as well
    // MD5(admin) = 21232f297a57a5a743894a0e4a801fc3
    // ArduinoOTA.setPasswordHash("21232f297a57a5a743894a0e4a801fc3");
  
    ArduinoOTA.onStart([]() {
      String type;
      if (ArduinoOTA.getCommand() == U_FLASH) {
        type = "sketch";
      } else { // U_FS
        type = "filesystem";
      }
  
      // NOTE: if updating FS this would be the place to unmount FS using FS.end()
      //Serial.println("Start updating " + type);
    });
    ArduinoOTA.onEnd([]() {
      //Serial.println("\nEnd");
    });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
      //Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
    });
    ArduinoOTA.onError([](ota_error_t error) {
      //Serial.printf("Error[%u]: ", error);
      if (error == OTA_AUTH_ERROR) {
        //Serial.println("Auth Failed");
      } else if (error == OTA_BEGIN_ERROR) {
        //Serial.println("Begin Failed");
      } else if (error == OTA_CONNECT_ERROR) {
        //Serial.println("Connect Failed");
      } else if (error == OTA_RECEIVE_ERROR) {
        //Serial.println("Receive Failed");
      } else if (error == OTA_END_ERROR) {
        //Serial.println("End Failed");
      }
    });
    ArduinoOTA.begin();
  
    uint32_t crc_bak = rtcData.crc32;
    uint64_t initTime = micros();//variable to take in account the time used for the second rtcWrite
    
    rtcData.crc32 = 0;
    ESP.rtcUserMemoryWrite(0, (uint32_t*) &rtcData.crc32, sizeof(rtcData.crc32));

    sleepTime_us = sleepTime_us - (micros() - initTime);
    
    while(micros() < sleepTime_us) {
      ArduinoOTA.handle();
      yield();//give the system a chance to execute
    }

    //Servono?
    WiFi.disconnect(true);
    delay(1);

    rtcData.crc32 = crc_bak;
    rtcData.sensor_state_time += micros() - intermediateTime;
    ESP.rtcUserMemoryWrite(0, (uint32_t*) &rtcData.sensor_state_time, sizeof(rtcData.sensor_state_time) + sizeof(rtcData.crc32));
    
    ESP.restart();
  } else if(battery <= OFF_TH_VOLTAGE) {
    
    rtcData.crc32 = 0;
    ESP.rtcUserMemoryWrite(0, (uint32_t*) &rtcData.crc32, sizeof(rtcData.crc32));

    //Servono?
    WiFi.disconnect(true);
    delay(1);
    
    ESP.deepSleep(0); //sleep until a reset occurs (in theory cause power supply plug)
    
  } else if(micros()+100 < sleepTime_us) { //avoid a possible "overflow" of time and a deepSleep shorter than 100uS (extimated execution time of the instructions inside the if)
    
    //LOG("Deep sleep for %llu ms. BSEC next call at %llu ms.", (sleepTime_us-micros())/1000, sensor.nextCall);

    rtcData.sensor_state_time += sleepTime_us - intermediateTime; //sleepTime_us - intermediateTime = micros() - intermediateTime + sleepTime_us - micros()
    ESP.rtcUserMemoryWrite(0, (uint32_t*) &rtcData.sensor_state_time, sizeof(rtcData.sensor_state_time));

    //Servono?
    WiFi.disconnect(true);
    delay(1);

    ESP.deepSleep(sleepTime_us - micros() + DEEPSLEEP_CORRECTION_TIME_US);
    
  } else {
    rtcData.sensor_state_time += micros() - intermediateTime;
    ESP.rtcUserMemoryWrite(0, (uint32_t*) &rtcData.sensor_state_time, sizeof(rtcData.sensor_state_time));

    //Servono?
    WiFi.disconnect(true);
    delay(1);
    
    ESP.restart();
  }
}

void loop() {}

//TODO: rename sensor_state_time

#endif
